{
  "version": "2.0",
  "routeKey": "POST /generate",
  "rawPath": "/generate",
  "rawQueryString": "",
  "headers": {
      "accept": "*/*",
      "accept-encoding": "br, gzip, deflate",
      "accept-language": "*",
      "content-length": "6897",
      "content-type": "application/json",
      "host": "b7oqgkz2ec.execute-api.us-east-1.amazonaws.com",
      "origin": "http://localhost:5173",
      "sec-fetch-mode": "cors",
      "user-agent": "node",
      "x-amzn-trace-id": "Root=1-65bfba14-321a653d4179d6e90861f124",
      "x-forwarded-for": "35.145.214.158",
      "x-forwarded-port": "443",
      "x-forwarded-proto": "https"
  },
  "requestContext": {
      "accountId": "082369611471",
      "apiId": "b7oqgkz2ec",
      "domainName": "b7oqgkz2ec.execute-api.us-east-1.amazonaws.com",
      "domainPrefix": "b7oqgkz2ec",
      "http": {
          "method": "POST",
          "path": "/generate",
          "protocol": "HTTP/1.1",
          "sourceIp": "35.145.214.158",
          "userAgent": "node"
      },
      "requestId": "SnoDNg8roAMEVEw=",
      "routeKey": "POST /generate",
      "stage": "$default",
      "time": "04/Feb/2024:16:23:48 +0000",
      "timeEpoch": 1707063828262
  },
  "body": "{\"description\":\"About the job\\r\\nPosition: Full Stack Developer\\r\\n\\r\\n\\r\\nAbout the role:\\r\\n\\r\\nAs an integral part of the Information Technology team, the Full Stack Developer will work under the direction of the Vice President of Information Technology to plan, develop, and implement internal web-based applications for the Company’s proprietary ERP system. The Full Stack Developer, as part of a development team, will be responsible for the creation of new modules, reports, and general maintenance of the Company’s web-based ERP system to assist in data tracking and efficiency throughout the Company.\\r\\n\\r\\n\\r\\nDo you have what it takes?\\r\\n\\r\\nWe pride ourselves in being flexible, but there are some things we feel very strongly about. We are careful to select people for our team that have demonstrated excellence through their skills, character, and background. It takes talent and drive to meet the challenges of our rapidly evolving environment – and that’s all the fun! Are you looking for new ways to raise the bar and don’t blink at challenges? Do you want a fulfilling career that takes advantage of your talents? If so, then it’s time to join DecoArt. Now is the time to be a part of something big!\\r\\n\\r\\n\\r\\nWhat you will be doing:\\r\\n\\r\\nDevelop and maintain web-based business applications for the Company’s ERP system in a PHP/MySQL/Linux/Apache environment.\\r\\nMake use of complicated SQL queries and database structure to effectively manage reporting interfaces, data speed and optimization, and data analyzation.\\r\\nAssist in custom development for eCommerce D2C and B2B sites.\\r\\nUse industry standards to write well designed, efficient, and testable code.\\r\\nDocument all aspects of assigned development tasks, including front-end, back-end, and database development.\\r\\nAssist in debugging, staging, testing, and deployment of websites and applications.\\r\\nEffectively perform complete testing of web applications and report results. \\r\\nExpand knowledge of new technologies as needed for new project requirements. Self-educate on industry standards and emerging technologies regularly.\\r\\nCreate and execute project work plans to ensure accountability.\\r\\nComply with departmental coding standards.\\r\\nManage time and commitments within project schedule.\\r\\nUtilize department ticketing software to track tasks and projects.\\r\\n\\r\\n\\r\\nWhat you need: \\r\\n\\r\\n4-year degree in Information Systems or equivalent experience\\r\\nHigh level knowledge of PHP, MySQL, HTML, CSS, JavaScript, Linux, AJAX, and JQuery\\r\\n2 years’ experience in web development with a heavy focus on back-end functionality consisting of: Object oriented development, Design patterns, and Complex SQL queries\\r\\nExperience in the design and implementation of technical solutions\\r\\nFunctional knowledge of Excel and other Office products\\r\\nHistory working with ERP systems, whether proprietary or big box (preferred)\\r\\nPredictive and generative AI experience (preferred)\\r\\nExperience with eCommerce platforms and plugins, specifically BigCommerce (preferred)\\r\\nFunctional knowledge of accounting including accounts payable, receivables and general ledger (preferred)\\r\\nHistory working with a manufacturing / distribution environment (preferred)\\r\\nAtlassian Jira / Confluence for ticketing and documentation (preferred)\\r\\nPHPStorm / Navicat for development and database manipulation (preferred)\\r\\nDemonstrated problem solving skills and the ability to implement solutions quickly\\r\\nAbility to work independently and prioritize tasks effectively\\r\\nExtremely organized, flexible, and able to work in a fast-paced environment with tight production timelines\\r\\nStrong interpersonal skills with ability to work closely with other departments and production entities\\r\\nCapable of multi-tasking and working on several projects at one time\\r\\nMust work well under pressure with the ability to meet tight deadlines\\r\\nMust be thorough with a strong sense of attention to detail and the ability to follow through\\r\\nAbility to work with a group of highly motivated individuals, as well as be individually proactive\\r\\nDesire to learn, seek new challenges and to take on additional responsibilities\\r\\nFriendly, engaging, and professional demeanor\\r\\nDemonstrated strong time management skills with a proven ability to meet deadlines\\r\\nAbility to prioritize tasks and to delegate them when appropriate\\r\\nAbility to maintain and hold confidential information\\r\\nDemonstrated ability to understand and follow written and verbal communication\\r\\nExcellent written and verbal communication skills, including strong presentation skills to varied audiences, and stakeholder groups\\r\\nAbility to lead and resolve problems on a professional level\\r\\nMust be resourceful and initiative-taking\\r\\nSelf-motivated, driven individual with collaborative communication style\\r\\nMust be willing to travel as needed and work at all DecoArt locations as needed\\r\\nThe determination to work harder than anyone you know \\r\\nAbility to occasionally lift up to 40 lbs.\\r\\nAbility to see product colors and differentiate between shades\\r\\n\\r\\n\\r\\nWhat we offer:\\r\\n\\r\\nCompetitive base salary\\r\\nComprehensive benefit package including quality health insurance, vision, dental, disability and life insurance\\r\\nTraditional 401k plan and company match\\r\\nPaid time off including paid holidays\\r\\n A chance to learn with and from interesting and enthusiastic colleagues\\r\\nCollaborative workplace, which will challenge you and celebrate your work\\r\\n\\r\\n\\r\\nWhere you'll be: 220 Lexington Green, Suite 400, Lexington, KY 40503\\r\\nThe candidate will be required to work onsite. This is not a remote or hybrid position.\\r\\n \\r\\nWhat we’d like from you:\\r\\n\\r\\nA resume that illustrates why you are the right person for this role.\\r\\nThis position does not meet the legal criteria for an independent contractor to perform the duties of the role.\\r\\n\\r\\n\\r\\nCome and Be Inspired!\\r\\n\\r\\nFor 35 years DecoArt has inspired creativity. In our consumers we inspire the creativity to craft, decorate, and make. In our employees we inspire the creativity to innovate, problem solve, and get things done.\\r\\n\\r\\n\\r\\nDecoArt is an Equal Opportunity/Affirmative Action Employer and committed to creating an inclusive employee experience for all. We welcome all qualified job seekers regardless of race, color, religion, sex, sexual orientation, gender identity, age, national origin, genetic information, disability, or protected veteran status.\\r\\n\\r\\n\\r\\n\\r\\nIf you have a disability and believe you need a reasonable accommodation to apply for this position, email HR@decoart.com with your request. This email address is not for general employment inquiries or correspondence. We will only respond to those requests that are related to the accessibility of the online application system due to a disability.\"}",
  "isBase64Encoded": false
}